{
  "name": "s3://eodata/CLMS/bio-geophysical/snow_cover_extent/clms_wsi_gap-filled-fractional-snow-cover_europe_utm_60m_daily_v1",
  "browserName": "GFSC Europe 60m Daily V1",
  "browserSearchPath": "CLMS Bio-geophysical Parameters, Snow, Snow Cover Extent",
  "collectionDescription": "The daily cumulative Gap-filled Fractional Snow Cover (GFSC) product provides pixel-wise snow cover extent as a percentage (0% – 100%) with a spatial resolution of 60 m x 60 m. It is generated on a daily basis at European scale based on synthetic aperture radar (SAR) data from the Sentinel-1 constellation and optical imagery from the Sentinel-2 constellation. The product is generated by merging all available Sentinel-1 and Sentinel-2 observations acquired over the previous seven days to produce a spatially complete composite of snow conditions, thereby reducing data gaps caused by cloud cover and sensor coverage limitations. Snow information derived from Sentinel-1 is focused on the detection of wet snow in high-mountain areas. It is available for the period from 2016 to the present. More information here.",
  "linkToCLMS": "https://land.copernicus.eu/en/products/snow/high-resolution-gap-filled-fractional-snow-cover",
  "spatialCoverage": "Europe",
  "temporalExtent": {
    "start": "2016",
    "end": "present"
  },
  "layers": [
    {
      "fileName": "GF",
      "layerBrowserName": "GF",
      "shortDescription": "Snow fraction (%)",
      "longDescription": "Fraction of the surface covered by snow (ranging from 0% to 100%). The dataset has also the following classes: cloud or cloud shadow (205), inland water (210), and no data (255).",
      "colourMapLink": "https://github.com/copernicus-land/colourmaps-legends/blob/main/colourmaps/clms_wsi_gap-filled-fractional-snow-cover/clms_wsi_gap-filled-fractional-snow-cover_europe_utm_60m_daily_v1_gf.sld",
      "legendLink": "",
      "display": 1
    }, 
    {
      "fileName": "GF-QA",
      "layerBrowserName": "GF-QA",
      "shortDescription": "Quality layer for the snow fraction (GF) layer",
      "longDescription": "Quality layer providing basic assessment of the snow fraction GF layer. For pixels with a QAFLAGS bit 7 value of 0, the data quality refers to the Sentinel-2 optical snow data quality. For pixels with a QAFLAGS bit 7 value of 1, the data quality refers to the Sentinel-1 SAR wet snow data quality.",
      "colourMapLink": "https://github.com/copernicus-land/colourmaps-legends/blob/main/colourmaps/clms_wsi_gap-filled-fractional-snow-cover/clms_wsi_gap-filled-fractional-snow-cover_europe_utm_60m_daily_v1_gf-qa.sld",
      "legendLink": "",
      "display": 1
    },
    {
      "fileName": "QAFLAGS",
      "layerBrowserName": "QAFLAGS",
      "shortDescription": "Quality flags",
      "longDescription": "Bitmask layer with pixel quality flags. The default visualisation displays the sensor type of the satellite data (optical=0, radar=1). These correspond to pixels where bit 7 is activated. Additional information can also be visualised by selecting other bits. More details are available in the </> Custom option.",
      "colourMapLink": "",
      "legendLink": "",
      "display": 1
    }, 
    {
      "fileName": "AT",
      "layerBrowserName": "AT",
      "shortDescription": "Sensing start date (seconds from Unix time).",
      "longDescription": "Timestamp of the data acquisition date. Expressed as the total number of seconds elapsed since the Unix epoch (01 January 1970, 00:00:00 UTC).",
      "colourMapLink": "",
      "legendLink": "",
      "display": 0
    }
  ]
}
